redis_bench_result/set_1024_6458.log
2023-11-21 23:22:13
====== SET ======
  4000000 requests completed in 24.77 seconds
  32 parallel clients
  1024 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: no

0.00% <= 0.1 milliseconds
0.07% <= 0.2 milliseconds
1.48% <= 0.3 milliseconds
5.09% <= 0.4 milliseconds
9.86% <= 0.5 milliseconds
14.27% <= 0.6 milliseconds
18.88% <= 0.7 milliseconds
24.40% <= 0.8 milliseconds
31.27% <= 0.9 milliseconds
38.96% <= 1.0 milliseconds
46.70% <= 1.1 milliseconds
54.12% <= 1.2 milliseconds
60.79% <= 1.3 milliseconds
66.41% <= 1.4 milliseconds
71.08% <= 1.5 milliseconds
74.99% <= 1.6 milliseconds
78.28% <= 1.7 milliseconds
80.96% <= 1.8 milliseconds
83.16% <= 1.9 milliseconds
84.93% <= 2 milliseconds
93.91% <= 3 milliseconds
97.14% <= 4 milliseconds
98.57% <= 5 milliseconds
99.20% <= 6 milliseconds
99.46% <= 7 milliseconds
99.62% <= 8 milliseconds
99.73% <= 9 milliseconds
99.81% <= 10 milliseconds
99.86% <= 11 milliseconds
99.90% <= 12 milliseconds
99.94% <= 13 milliseconds
99.97% <= 14 milliseconds
99.98% <= 15 milliseconds
99.99% <= 16 milliseconds
99.99% <= 17 milliseconds
99.99% <= 18 milliseconds
100.00% <= 18 milliseconds
161511.75 requests per second