redis_bench_result/set_128_6463.log
2023-11-21 22:53:31
====== SET ======
  20000000 requests completed in 107.58 seconds
  32 parallel clients
  128 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: no

0.00% <= 0.1 milliseconds
0.44% <= 0.2 milliseconds
3.50% <= 0.3 milliseconds
9.64% <= 0.4 milliseconds
15.99% <= 0.5 milliseconds
22.44% <= 0.6 milliseconds
29.32% <= 0.7 milliseconds
36.87% <= 0.8 milliseconds
44.64% <= 0.9 milliseconds
52.19% <= 1.0 milliseconds
59.06% <= 1.1 milliseconds
65.07% <= 1.2 milliseconds
70.10% <= 1.3 milliseconds
74.22% <= 1.4 milliseconds
77.64% <= 1.5 milliseconds
80.45% <= 1.6 milliseconds
82.78% <= 1.7 milliseconds
84.76% <= 1.8 milliseconds
86.44% <= 1.9 milliseconds
87.91% <= 2 milliseconds
95.43% <= 3 milliseconds
97.94% <= 4 milliseconds
98.95% <= 5 milliseconds
99.42% <= 6 milliseconds
99.67% <= 7 milliseconds
99.78% <= 8 milliseconds
99.86% <= 9 milliseconds
99.90% <= 10 milliseconds
99.93% <= 11 milliseconds
99.96% <= 12 milliseconds
99.98% <= 13 milliseconds
99.99% <= 14 milliseconds
99.99% <= 15 milliseconds
100.00% <= 16 milliseconds
100.00% <= 18 milliseconds
100.00% <= 19 milliseconds
100.00% <= 20 milliseconds
100.00% <= 21 milliseconds
100.00% <= 24 milliseconds
100.00% <= 25 milliseconds
100.00% <= 25 milliseconds
185911.61 requests per second