redis_bench_result/set_16_128_6443.log
2023-11-24 03:23:53
====== SET ======
  4000088 requests completed in 19.48 seconds
  16 parallel clients
  128 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: no

0.69% <= 0.1 milliseconds
15.87% <= 0.2 milliseconds
34.64% <= 0.3 milliseconds
50.57% <= 0.4 milliseconds
62.99% <= 0.5 milliseconds
72.12% <= 0.6 milliseconds
79.00% <= 0.7 milliseconds
83.79% <= 0.8 milliseconds
87.19% <= 0.9 milliseconds
89.69% <= 1.0 milliseconds
91.56% <= 1.1 milliseconds
92.95% <= 1.2 milliseconds
94.03% <= 1.3 milliseconds
94.89% <= 1.4 milliseconds
95.60% <= 1.5 milliseconds
96.22% <= 1.6 milliseconds
96.74% <= 1.7 milliseconds
97.15% <= 1.8 milliseconds
97.48% <= 1.9 milliseconds
97.77% <= 2 milliseconds
99.37% <= 3 milliseconds
99.75% <= 4 milliseconds
99.88% <= 5 milliseconds
99.94% <= 6 milliseconds
99.97% <= 7 milliseconds
99.98% <= 8 milliseconds
99.99% <= 9 milliseconds
99.99% <= 10 milliseconds
100.00% <= 11 milliseconds
100.00% <= 11 milliseconds
205332.78 requests per second