redis_bench_result/set_16_256_6505.log
2023-11-24 03:25:04
====== SET ======
  4000000 requests completed in 20.17 seconds
  16 parallel clients
  256 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: no

0.53% <= 0.1 milliseconds
13.29% <= 0.2 milliseconds
30.52% <= 0.3 milliseconds
46.45% <= 0.4 milliseconds
60.13% <= 0.5 milliseconds
70.25% <= 0.6 milliseconds
77.64% <= 0.7 milliseconds
82.89% <= 0.8 milliseconds
86.56% <= 0.9 milliseconds
89.24% <= 1.0 milliseconds
91.22% <= 1.1 milliseconds
92.74% <= 1.2 milliseconds
93.89% <= 1.3 milliseconds
94.80% <= 1.4 milliseconds
95.50% <= 1.5 milliseconds
96.09% <= 1.6 milliseconds
96.60% <= 1.7 milliseconds
97.02% <= 1.8 milliseconds
97.39% <= 1.9 milliseconds
97.69% <= 2 milliseconds
99.35% <= 3 milliseconds
99.76% <= 4 milliseconds
99.90% <= 5 milliseconds
99.93% <= 6 milliseconds
99.96% <= 7 milliseconds
99.98% <= 8 milliseconds
99.99% <= 9 milliseconds
100.00% <= 17 milliseconds
100.00% <= 18 milliseconds
100.00% <= 18 milliseconds
198334.00 requests per second