redis_bench_result/set_16_32_6461.log
2023-11-24 03:16:17
====== SET ======
  20000016 requests completed in 97.01 seconds
  16 parallel clients
  32 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: no

0.95% <= 0.1 milliseconds
16.00% <= 0.2 milliseconds
34.31% <= 0.3 milliseconds
50.39% <= 0.4 milliseconds
62.84% <= 0.5 milliseconds
71.82% <= 0.6 milliseconds
78.64% <= 0.7 milliseconds
83.53% <= 0.8 milliseconds
87.03% <= 0.9 milliseconds
89.58% <= 1.0 milliseconds
91.48% <= 1.1 milliseconds
92.94% <= 1.2 milliseconds
94.11% <= 1.3 milliseconds
95.05% <= 1.4 milliseconds
95.78% <= 1.5 milliseconds
96.36% <= 1.6 milliseconds
96.84% <= 1.7 milliseconds
97.24% <= 1.8 milliseconds
97.59% <= 1.9 milliseconds
97.90% <= 2 milliseconds
99.42% <= 3 milliseconds
99.81% <= 4 milliseconds
99.92% <= 5 milliseconds
99.96% <= 6 milliseconds
99.98% <= 7 milliseconds
99.99% <= 8 milliseconds
99.99% <= 9 milliseconds
99.99% <= 10 milliseconds
100.00% <= 11 milliseconds
100.00% <= 12 milliseconds
100.00% <= 13 milliseconds
100.00% <= 24 milliseconds
100.00% <= 25 milliseconds
100.00% <= 25 milliseconds
206162.34 requests per second