redis_bench_result/set_16_32_6467.log
2023-11-24 03:16:17
====== SET ======
  20000000 requests completed in 97.06 seconds
  16 parallel clients
  32 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: no

0.73% <= 0.1 milliseconds
15.84% <= 0.2 milliseconds
34.19% <= 0.3 milliseconds
50.16% <= 0.4 milliseconds
62.83% <= 0.5 milliseconds
71.90% <= 0.6 milliseconds
78.73% <= 0.7 milliseconds
83.61% <= 0.8 milliseconds
87.08% <= 0.9 milliseconds
89.64% <= 1.0 milliseconds
91.55% <= 1.1 milliseconds
93.00% <= 1.2 milliseconds
94.15% <= 1.3 milliseconds
95.07% <= 1.4 milliseconds
95.80% <= 1.5 milliseconds
96.38% <= 1.6 milliseconds
96.87% <= 1.7 milliseconds
97.27% <= 1.8 milliseconds
97.60% <= 1.9 milliseconds
97.90% <= 2 milliseconds
99.45% <= 3 milliseconds
99.82% <= 4 milliseconds
99.93% <= 5 milliseconds
99.97% <= 6 milliseconds
99.99% <= 7 milliseconds
99.99% <= 8 milliseconds
99.99% <= 9 milliseconds
100.00% <= 10 milliseconds
100.00% <= 11 milliseconds
100.00% <= 14 milliseconds
100.00% <= 15 milliseconds
100.00% <= 21 milliseconds
100.00% <= 22 milliseconds
100.00% <= 22 milliseconds
206062.36 requests per second