redis_bench_result/set_16_6414.log
2023-11-21 22:38:22
====== SET ======
  20000048 requests completed in 92.46 seconds
  32 parallel clients
  16 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: no

0.00% <= 0.1 milliseconds
0.93% <= 0.2 milliseconds
6.14% <= 0.3 milliseconds
14.90% <= 0.4 milliseconds
23.18% <= 0.5 milliseconds
32.03% <= 0.6 milliseconds
40.91% <= 0.7 milliseconds
49.46% <= 0.8 milliseconds
56.99% <= 0.9 milliseconds
63.60% <= 1.0 milliseconds
69.28% <= 1.1 milliseconds
74.07% <= 1.2 milliseconds
78.02% <= 1.3 milliseconds
81.29% <= 1.4 milliseconds
83.95% <= 1.5 milliseconds
86.11% <= 1.6 milliseconds
87.88% <= 1.7 milliseconds
89.32% <= 1.8 milliseconds
90.54% <= 1.9 milliseconds
91.57% <= 2 milliseconds
96.90% <= 3 milliseconds
98.73% <= 4 milliseconds
99.41% <= 5 milliseconds
99.72% <= 6 milliseconds
99.85% <= 7 milliseconds
99.91% <= 8 milliseconds
99.95% <= 9 milliseconds
99.96% <= 10 milliseconds
99.97% <= 11 milliseconds
99.98% <= 12 milliseconds
99.98% <= 13 milliseconds
99.99% <= 14 milliseconds
99.99% <= 15 milliseconds
100.00% <= 16 milliseconds
100.00% <= 19 milliseconds
100.00% <= 20 milliseconds
100.00% <= 23 milliseconds
100.00% <= 24 milliseconds
100.00% <= 24 milliseconds
216305.59 requests per second