redis_bench_result/set_16_6447.log
2023-11-21 22:38:22
====== SET ======
  20000112 requests completed in 92.32 seconds
  32 parallel clients
  16 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: no

0.00% <= 0.1 milliseconds
1.28% <= 0.2 milliseconds
6.56% <= 0.3 milliseconds
14.91% <= 0.4 milliseconds
22.99% <= 0.5 milliseconds
31.72% <= 0.6 milliseconds
40.70% <= 0.7 milliseconds
49.28% <= 0.8 milliseconds
56.87% <= 0.9 milliseconds
63.50% <= 1.0 milliseconds
69.15% <= 1.1 milliseconds
73.91% <= 1.2 milliseconds
77.90% <= 1.3 milliseconds
81.20% <= 1.4 milliseconds
83.87% <= 1.5 milliseconds
86.05% <= 1.6 milliseconds
87.79% <= 1.7 milliseconds
89.25% <= 1.8 milliseconds
90.48% <= 1.9 milliseconds
91.53% <= 2 milliseconds
96.96% <= 3 milliseconds
98.75% <= 4 milliseconds
99.44% <= 5 milliseconds
99.70% <= 6 milliseconds
99.81% <= 7 milliseconds
99.88% <= 8 milliseconds
99.93% <= 9 milliseconds
99.96% <= 10 milliseconds
99.97% <= 11 milliseconds
99.97% <= 12 milliseconds
99.98% <= 13 milliseconds
99.99% <= 14 milliseconds
99.99% <= 15 milliseconds
100.00% <= 16 milliseconds
100.00% <= 17 milliseconds
100.00% <= 20 milliseconds
100.00% <= 21 milliseconds
100.00% <= 21 milliseconds
216629.61 requests per second