redis_bench_result/set_16_6484.log
2023-11-21 22:38:22
====== SET ======
  20000040 requests completed in 92.64 seconds
  32 parallel clients
  16 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: no

0.00% <= 0.1 milliseconds
1.02% <= 0.2 milliseconds
6.22% <= 0.3 milliseconds
14.93% <= 0.4 milliseconds
23.16% <= 0.5 milliseconds
31.88% <= 0.6 milliseconds
40.68% <= 0.7 milliseconds
49.19% <= 0.8 milliseconds
56.79% <= 0.9 milliseconds
63.38% <= 1.0 milliseconds
69.05% <= 1.1 milliseconds
73.84% <= 1.2 milliseconds
77.82% <= 1.3 milliseconds
81.10% <= 1.4 milliseconds
83.78% <= 1.5 milliseconds
85.95% <= 1.6 milliseconds
87.72% <= 1.7 milliseconds
89.19% <= 1.8 milliseconds
90.43% <= 1.9 milliseconds
91.49% <= 2 milliseconds
96.95% <= 3 milliseconds
98.74% <= 4 milliseconds
99.41% <= 5 milliseconds
99.68% <= 6 milliseconds
99.82% <= 7 milliseconds
99.89% <= 8 milliseconds
99.93% <= 9 milliseconds
99.95% <= 10 milliseconds
99.97% <= 11 milliseconds
99.97% <= 12 milliseconds
99.98% <= 13 milliseconds
99.99% <= 14 milliseconds
99.99% <= 15 milliseconds
99.99% <= 16 milliseconds
100.00% <= 17 milliseconds
100.00% <= 18 milliseconds
100.00% <= 26 milliseconds
100.00% <= 27 milliseconds
100.00% <= 27 milliseconds
215889.89 requests per second