redis_bench_result/set_16_64_6499.log
2023-11-24 03:19:59
====== SET ======
  20000080 requests completed in 100.66 seconds
  16 parallel clients
  64 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: no

0.69% <= 0.1 milliseconds
13.84% <= 0.2 milliseconds
31.14% <= 0.3 milliseconds
47.06% <= 0.4 milliseconds
60.48% <= 0.5 milliseconds
70.27% <= 0.6 milliseconds
77.50% <= 0.7 milliseconds
82.67% <= 0.8 milliseconds
86.38% <= 0.9 milliseconds
89.02% <= 1.0 milliseconds
90.98% <= 1.1 milliseconds
92.52% <= 1.2 milliseconds
93.70% <= 1.3 milliseconds
94.62% <= 1.4 milliseconds
95.38% <= 1.5 milliseconds
95.98% <= 1.6 milliseconds
96.48% <= 1.7 milliseconds
96.91% <= 1.8 milliseconds
97.29% <= 1.9 milliseconds
97.62% <= 2 milliseconds
99.36% <= 3 milliseconds
99.80% <= 4 milliseconds
99.92% <= 5 milliseconds
99.97% <= 6 milliseconds
99.98% <= 7 milliseconds
99.99% <= 8 milliseconds
99.99% <= 9 milliseconds
100.00% <= 10 milliseconds
100.00% <= 11 milliseconds
100.00% <= 12 milliseconds
100.00% <= 13 milliseconds
100.00% <= 22 milliseconds
100.00% <= 22 milliseconds
198681.55 requests per second