redis_bench_result/set_16_6507.log
2023-11-21 22:38:22
====== SET ======
  20000000 requests completed in 93.42 seconds
  32 parallel clients
  16 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: no

0.00% <= 0.1 milliseconds
0.83% <= 0.2 milliseconds
5.64% <= 0.3 milliseconds
13.92% <= 0.4 milliseconds
21.91% <= 0.5 milliseconds
30.35% <= 0.6 milliseconds
39.27% <= 0.7 milliseconds
48.08% <= 0.8 milliseconds
55.90% <= 0.9 milliseconds
62.70% <= 1.0 milliseconds
68.60% <= 1.1 milliseconds
73.61% <= 1.2 milliseconds
77.72% <= 1.3 milliseconds
81.05% <= 1.4 milliseconds
83.74% <= 1.5 milliseconds
85.91% <= 1.6 milliseconds
87.67% <= 1.7 milliseconds
89.14% <= 1.8 milliseconds
90.39% <= 1.9 milliseconds
91.43% <= 2 milliseconds
96.85% <= 3 milliseconds
98.68% <= 4 milliseconds
99.39% <= 5 milliseconds
99.71% <= 6 milliseconds
99.84% <= 7 milliseconds
99.91% <= 8 milliseconds
99.94% <= 9 milliseconds
99.97% <= 10 milliseconds
99.97% <= 11 milliseconds
99.98% <= 12 milliseconds
99.99% <= 13 milliseconds
99.99% <= 14 milliseconds
99.99% <= 15 milliseconds
99.99% <= 16 milliseconds
100.00% <= 17 milliseconds
100.00% <= 18 milliseconds
100.00% <= 19 milliseconds
100.00% <= 20 milliseconds
100.00% <= 21 milliseconds
100.00% <= 21 milliseconds
214086.92 requests per second