redis_bench_result/set_256_6395.log
2023-11-21 23:01:38
====== SET ======
  12000000 requests completed in 67.55 seconds
  32 parallel clients
  256 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: no

0.00% <= 0.1 milliseconds
0.40% <= 0.2 milliseconds
3.48% <= 0.3 milliseconds
9.20% <= 0.4 milliseconds
15.38% <= 0.5 milliseconds
22.00% <= 0.6 milliseconds
29.29% <= 0.7 milliseconds
37.25% <= 0.8 milliseconds
45.31% <= 0.9 milliseconds
52.94% <= 1.0 milliseconds
59.70% <= 1.1 milliseconds
65.47% <= 1.2 milliseconds
70.30% <= 1.3 milliseconds
74.24% <= 1.4 milliseconds
77.51% <= 1.5 milliseconds
80.17% <= 1.6 milliseconds
82.37% <= 1.7 milliseconds
84.21% <= 1.8 milliseconds
85.79% <= 1.9 milliseconds
87.13% <= 2 milliseconds
94.07% <= 3 milliseconds
96.69% <= 4 milliseconds
97.92% <= 5 milliseconds
98.62% <= 6 milliseconds
99.01% <= 7 milliseconds
99.32% <= 8 milliseconds
99.55% <= 9 milliseconds
99.69% <= 10 milliseconds
99.79% <= 11 milliseconds
99.85% <= 12 milliseconds
99.90% <= 13 milliseconds
99.93% <= 14 milliseconds
99.95% <= 15 milliseconds
99.96% <= 16 milliseconds
99.97% <= 17 milliseconds
99.97% <= 18 milliseconds
99.98% <= 19 milliseconds
99.98% <= 20 milliseconds
99.99% <= 21 milliseconds
99.99% <= 22 milliseconds
99.99% <= 23 milliseconds
100.00% <= 24 milliseconds
100.00% <= 25 milliseconds
100.00% <= 30 milliseconds
100.00% <= 30 milliseconds
177643.55 requests per second